1:WizardBadges
00000000

Golem Tower Champion
000000000316

Catch 25 'Catch of the Day' fish.
00000001

Defeat the Iron Golem in the Golem Tower
00000002

Iron Golem
00000003

Hero of Unicorn Way
00000004

Complete all Quests on Unicorn Way
00000005

Unicorn Way Quests
00000006

Three Streets Savior
00000007

Complete all Quests on Firecat Alley, Triton Avenue, and Cyclops Lane
00000008

Master Diplomat
00000009

Complete all Quests on Colossus Boulevard
00000010

Wizard City Protector
00000011

Defeat Lord Nightshade
00000012

Lord Nightshade
00000013

Gobbler Chaser
00000014

Defeat 25 Gobblers
00000015

Gobblers
00000016

Gobbler Catcher
00000017

Defeat 50 Gobblers
00000018

Gobbler Gobbler
00000019

Defeat 100 Gobblers
00000020

Savior of Wizard City
00000021

Complete all Quests of Wizard City
00000022

Wizard City Explorer
00000023

Complete Find the Smiths
00000024

Sunken City Survivor
00000025

Complete all Quests of the Sunken City
00000026

Krok Thrasher
00000027

Defeat 50 Krokotopians
00000028

Krokotopians
00000029

Krok Hunter
00000030

Defeat 100 Krokotopians
00000031

Krok Slayer
00000032

Defeat 200 Krokotopians
00000033

Junior Archeologist
00000034

Complete all Quests in Pyramid of the Sun
00000035

Krokosphinx Delver
00000036

Complete all Quests in the Krokosphinx
00000037

Tomb Raider
00000038

Complete all the Quests in the Tomb of Storms
00000039

Order of the Fang
00000040

Become a member of the Order of the Fang
00000041

Hero of Krokotopia
00000042

Defeat Krokopatra
00000043

Master of The Oasis
00000044

Complete all the Quests of Krokotopia
00000045

Krokotopia Explorer
00000046

Find all the Beatles
00000047

Mander Savior
00000048

Complete all the Quests of the Tomb of the Beguiler
00000049

Secret Shopper
00000050

Visit the Secret Shop 5 times
00000051

Mastermind
00000052

Defeat Meowiarty
00000053

Hero of Marleybone
00000054

Complete all the Quests in Marleybone
00000055

Honorary Detective
00000056

Complete certain MB Quests
00000057

Aeronaut
00000058

Complete all Quests at Digmoore Station
00000059

Member of the Watch
00000060

Complete all Quests in Scotland Yard
00000061

Honorary Engineer
00000062

Complete all Quests in Royal Museum
00000063

Marleybone Explorer
00000064

Find all the Stray Cats
00000065

Smogger Smasher
00000066

Defeat Smogger
00000067

Cat Curtailer
00000068

Defeat 100 Cats
00000069

Cat Herder
00000070

Defeat 250 Cats
00000071

Meow Master
00000072

Defeat 400 Cats
00000073

Crusher Crusher
00000074

Defeat Spike the Crusher
00000075

Machine Master
00000076

Defeat Stoker in Kensington Park
00000077

Rat Catcher
00000078

Defeat 50 Rats
00000079

Rat Trapper
00000080

Defeat 100 Rats
00000081

Pied Piper
00000082

Defeat 200 Rats
00000083

Oni Slayer
00000084

Defeat the Jade Oni
00000085

Emerald Champion
00000086

Complete all the Quest in MooShu
00000087

Sword Saint
00000088

Defeat Youkai
00000089

Ninja Hunter
00000090

Defeat 100 Pigs
00000091

Pigs
00000092

Ninja Slayer
00000093

Defeat 250 Pigs
00000094

Nightstalker
00000095

Defeat 400 Pigs
00000096

Ronin Hunter
00000097

Defeat 50 Samoorai
00000098

Samoorai
00000099

Yojimbo
00000100

Defeat 100 Samoorai
00000101

Samurai
00000102

Defeat 200 Samoorai
00000103

MooShu Explorer
00000104

Find the Blue Oysters
00000105

The Purifier
00000106

Complete all Plague Quests
00000107

Peacemaker
00000108

Complete all War Quests
00000109

Spirit Walker
00000110

Complete all Death Quests
00000111

Master of Fire
00000112

Learn all the Fire Spells
00000113

Master of Ice
00000114

Learn all the Ice Spells
00000115

Master of Storm
00000116

Learn all the Storm Spells
00000117

Master of Monsters
00000118

Learn all the Myth Spells
00000119

Master of Nature
00000120

Learn all the Life Spells
00000121

Master of Death
00000122

Learn all the Death Spells
00000123

Master of Balance
00000124

Learn all the Balance Spells
00000125

Master Explorer
00000126

Complete all the Explore Quests
00000127

Spider Squisher
00000128

Defeat 50 Spiders
00000129

Spiders
00000130

Web Cutter
00000131

Defeat 100 Spiders
00000132

Chitin Crusher
00000133

Defeat 250 Spiders
00000134

Spiderbane
00000135

Defeat 500 Spiders
00000136

Giant Hunter
00000137

Defeat 50 Giants
00000138

Giant Smasher
00000139

Defeat 100 Giants
00000140

Blood of the Giants
00000141

Defeat 350 Giants
00000142

Giants
00000143

Undead Stalker
00000144

Defeat 50 Undead
00000145

Undead
00000146

Undead Hunter
00000147

Defeat 100 Undead
00000148

Undead Conquerer
00000149

Defeat 500 Undead
00000150

Undead Crusader
00000151

Defeat 1000 Undead
00000152

Undead Slayer
00000153

Defeat 2000 Undead
00000154

Golem Breaker
00000155

Defeat 50 Golems
00000156

Golems
00000157

Golem Destroyer
00000158

Defeat 200 Golems
00000159

Technomancer
00000160

Defeat 500 Golems
00000161

Elemental Dispeller
00000162

Defeat 50 Elementals
00000163

Elementals
00000164

Elemental Banisher
00000165

Defeat 250 Elementals
00000166

Elementalist
00000167

Defeat 500 Elementals
00000168

Cats
00000169

Cats
00000170

Cats
00000171

Rats
00000172

Rats
00000173

Rats
00000174

Krokopatra
00000175

Dragonspyre Master
00000176

Complete all quests in Dragonspyre
00000177

Ghostbuster
00000178

Complete all the quests in The Necropolis
00000179

Loremaster
00000180

Complete all the quests in The Library
00000181

Dragonrider
00000182

Complete all the quests for Dragonspyre Academy
00000183

Draconian Slayer
00000184

Defeat 50 Draconians
00000185

Draconians
00000186

Draconian Bane
00000187

Defeat 100 Draconians
00000188

Draconian Master
00000189

Defeat 200 Draconians
00000190

Savior of the Spiral
00000191

Defeat Malistaire
00000193

Dragonspyre Explorer
00000194

Find all the Stone Roses
00000207

Bookworm
00000208

Malistaire
00000209

Complete 100 Obstacle Courses
00000210

Ninja Master
00000211

Perfect Ninja Pig Courses
00000212

Ninja Sensei
00000213

Complete 100 Obstacle Courses
00000214

Campaigner
00000215

Successfully clear 50 Grumpy Gobbler courses
00000216

Ninja Pig Courses
00000217

Grumpy Gobbler Courses
00000218

Grumpy Warlord
00000219

Successfully clear 100 Grumpy Gobbler courses
00000220

Complete 50 Obstacle Courses
00000221

Ninja Master
00000222

Master of Shapes
00000223

Learn all Polymorph spells
00000224

Kill 50 Bees
00000225

Bees
00000226

Bee Stinger
00000227

Kill 100 Bees
00000228

Hive Master
00000229

Kill 200 Bees
00000230

Centipede Impeder
00000231

Kill 50 Millipedes
00000232

Millipedes
00000233

Hundred Legger Breaker
00000234

Kill 100 Millipedes
00000235


00000236

Centipede Stalker
00000237

Kill 200 Millipedes
00000238

Master Centipede Crusher
00000239

Kill 1000 Millipedes
00000240

Scorpion Squisher
00000241

Kill 50 Scorpions
00000242

Scorpions
00000243

Scorpion Stinger
00000244

Kill 100 Scorpions
00000245

Scourge of the Scorpions
00000246

Kill 200 Scorpions
00000247

The Exterminator
00000248

Complete Hive Master, Centipede Stalker and Scourge of the Scorpions
00000249

Initiate Shadowmancer
00000250

Learn Shadow Magic
00000251

Khrysalis Explorer
00000252

Collect Crickets
00000253

Harbinger of Light
00000254

Finish Khrysalis Part 1
00000255

Defeat Morganthe's Warlords
00000256

Kill 50 Spider Mages
00000257

Spider Mages
00000258

Kill 100 Spider Mages
00000259

Kill 200 Spider Mages
00000260

Kill 50 Mantises
00000261

Mantises
00000262

Kill 100 Mantises
00000263

Kill 200 Mantises
00000264

Defeat Moros
00000265

Child of Light and Shadow
00000266

Defeat Morganthe
00000267

Defeat Morganthe's Warlords
00000268

Learn Shadow Creatures
00000269

Legendary Explorer
00000270

Collect Iron Butterflies
00000271

Dino Eradicator
00000272

Complete Scourge of the Scales, Dino Devastator and Primordial Foe
00000273

Spiral Cup Tutor
00000274

Stopped Handsom Fomori
00000275

Novice Angler
00000276

Neophyte Angler
00000277

Apprentice Angler
00000278

Initiate Angler
00000279

Intermediate Angler
00000280

Journeyman Angler
00000281

Expert Angler
00000282

Adept Angler
00000283

Master Fish Angler
00000284

Grandmaster Angler
00000285

Gone Fishin'
00000286

Fishy Business
00000287

Deep Sea Pro
00000288

Catch of the Day
00000289

Hook, Line and Sinker
00000290

Skipper
00000291

Angler Management
00000292

Master Caster
00000293

Baited Breath
00000294

Drop the Bass
00000295

Complete Shangri-Baa Gauntlet
00000296

Lamba of Harmony
00000297

Royal Marleybonian Order
00000298

Complete Barkingham Palace Gauntlet
00000299

House of Scales Champion
00000300

Complete House of Scales Gauntlet
00000301

Victor of Kan Davasi
00000302

Complete Castle Darkmoor Gauntlet
00000303

Fish Whisperer
00000304

Complete 150 Obstacle Courses
00000305

Ninja Grandmaster
00000306

Legendary Angler
00000308

Transcendent Angler
00000309

Archmage Angler
00000310

Promethean Angler
00000311

Exalted Angler
00000313

Fishing Tournament Winner
00000314

Catch of the Day 10
00000315

Catch of the Day 25
00000316

Catch 25 Catch of the Day Fish
00000317

Medal Catcher
00000318

You earned a Medal in a Fishing Tournament!
00000319

Earn a Medal in a Fishing Tournament
00000320

Catcher of the Week
00000321

Catch 7 'Catch of the Day' fish in a row.
00000322

Clutch Catcher
00000323

You caught 25 'Catch of the Day' fish!
00000324

You caught 7 'Catch of the Day' fish in a row!
00000325

Osky Boxer
00000326

Defeat 50 Polar Bears
00000327

Polar Bears
00000328

Osky Wrestler
00000329

Defeat 100 Polar Bears
00000330

Osky Mauler
00000331

Defeat 250 Polar Bears
00000332

Osky Trouncer
00000333

Defeat 500 Polar Bears
00000334

Inspectors' Adversary
00000335

Defeat 50 Penguins
00000336

Penguins
00000337

Inspectors' Rival
00000338

Defeat 100 Penguins
00000339

Inspectors' Nightmare
00000340

Defeat 250 Penguins
00000341

Inspectors' Torment
00000342

Defeat 500 Penguins
00000343

Tundra Troll Roller
00000344

Defeat 50 Tundra Trolls
00000345

Tundra Trolls
00000346

Tundra Troll Topper
00000347

Defeat 100 Tundra Trolls
00000348

Tundra Troll Tormentor
00000349

Defeat 250 Tundra Trolls
00000350

Defeat 500 Tundra Trolls
00000351

Tundra Troll Toll Taker
00000352

Sea Lion Tamer
00000353

Defeat 50 Sea Lions
00000354

Sea Lions
00000355

Sea Lion Herder
00000356

Defeat 100 Sea Lions
00000357

Sea Lion Wrangler
00000358

Defeat 250 Sea Lions
00000359

Sea Lion Stalker
00000360

Defeat 500 Sea Lions
00000361

Guest of the Veiled Vale
00000362

Defeat Baba Yaga
00000363

Baba Yaga
00000364

Valiant of the Sunless Shrine
00000365

Defeat Vigilant Jarilo
00000366

Vigilant Jarilo
00000367

Pit Boss's Bane
00000368

Defeat Pit Boss Minak
00000369

Pit Boss Minak
00000370

True Comrade
00000371

Defeat Ivan the Greater
00000372

Ivan the Greater
00000373

Iceblock Crusher
00000374

Defeat Ygor
00000375

Ygor
00000376

Champion of the Borealis Peaks
00000377

Defeat Warlord Minak
00000378

Warlord Minak
00000379

Gravulum Magus
00000380

You did the Daily Assignment for 15 days!
00000381

Do the Daily Assignment for 15 days
00000382

Grumpy Governor
00000383

Successfully clear 150 Grumpy Gobbler courses
00000384

Prodigious Angler
00000385

Hatching Specialist
00000386

Hatching Expert
00000387

Hatching Master
00000388

Complete quest where Arcanum Apartment is awarded
00000389

Complete mainline quests in Mirage
00000390

Complete Roc'qhui Bal'Boa quests in Istanboa
00000391

Undead Educator
00000392

Rookie Monstrologist
00000393

Novice Monstrologist
00000394

Tenderfoot Monstrologist
00000395

Neophyte Monstrologist
00000396

Apprentice Monstrologist
00000397

Initiate Monstrologist
00000398

Intermediate Monstrologist
00000399

Journeyman Monstrologist
00000400

Monstrology Specialist
00000401

Adept Monstrologist
00000402

Monstrology Whiz
00000403

Hotshot Monstrologist
00000404

Dexterous Monstrologist
00000405

Monstrology Virtuoso
00000406

Master Monstrologist
00000407

Grandmaster Monstrologist
00000408

Legendary Monstrologist
00000409

Gifted Monstrologist
00000410

Transcendent Monstrologist
00000411

Archmage Monstrologist
00000412

Promethean Monstrologist
00000413

Superior Monstrologist
00000414

Renowned Monstrologist
00000415

Illustrious Monstrologist
00000416

Exalted Monstrologist
00000417

Plenty of Animus
00000418

You collected 100 Animus
00000419

Collect 100 Animus
00000420

Oodles of Animus
00000421

You collected 1000 Animus
00000422

Collect 1000 Animus
00000423

Hoards of Animus
00000424

You collected 10000 Animus
00000425

Collect 10000 Animus
00000426

Pockets Full of Animus
00000427

You collected 20000 Animus
00000428

Collect 20000 Animus
00000429

Defeat 4000 Undead
00000430

Defeat 8000 Undead
00000431

Undead Assassin
00000432

Defeat 10000 Undead
00000433

Undead Enforcer
00000434

Undead Cutthroat
00000435

Defeat 15000 Undead
00000436

Undead Master
00000437

Defeat 20000 Undead
00000438

Undead Executioner
00000439

Hatching Grandmaster
00000440

Champion of Metallos
00000441

Complete Sinbad & the Iron Sultan Gauntlet
00000442

Varsity Balance Deckathlete 
00000443

Varsity Death Deckathlete 
00000444

Varsity Fire Deckathlete 
00000445

Varsity Ice Deckathlete 
00000446

Varsity Life Deckathlete 
00000447

Varsity Myth Deckathlete 
00000448

Varsity Storm Deckathlete 
00000449

Balestrom's Bane
00000450

Cyrus' Superior
00000451

Wu's Woe
00000452

Greyrose's Grief
00000453

Falmea's Foe
00000454

Dworgyn's Defeater
00000455

Alhazred's Antagonist
00000456

Deckathalon Champion
00000457

Top 10 Balance Deckathlete
00000458

Top 10 Death Deckathlete
00000459

Top 10 Fire Deckathlete
00000460

Top 10 Ice Deckathlete
00000461

Top 10 Life Deckathlete
00000462

Top 10 Myth Deckathlete
00000463

Top 10 Storm Deckathlete
00000464

Balance Deckathalon Finalist
00000465

Death Deckathalon Finalist
00000466

Fire Deckathalon Finalist
00000467

Ice Deckathalon Finalist
00000468

Life Deckathalon Finalist
00000469

Myth Deckathalon Finalist
00000470

Storm Deckathalon Finalist
00000471

Deckath-Elite
00000472

Top 10 All Schools
00000473

Maze Game Hotshot
00000474

Maze Game Ace
00000475

Maze Game Star
00000476

Win Maze Games
00000477

Cannon Game Hotshot
00000478

Cannon Game Ace
00000479

Cannon Game Star
00000480

Win Cannon Games
00000481

Dance Game Hotshot
00000482

Dance Game Ace
00000483

Dance Game Star
00000484

Win Dance Games
00000485

Gobbler Drop Hotshot
00000486

Gobbler Drop Ace
00000487

Gobbler Drop Star
00000488

Win Gobbler Drop Games
00000489

Way of the Ninja Pig Hotshot
00000490

Grumpy Gobbler Hotshot
00000491

Generous Pet Lender
00000492

Beneficent Pet Lender
00000493

Philanthropic Pet Lender
00000494

Magnanimous Pet Lender
00000495

Gobbler Chaser
00000496

TBD
00000497

Defeat 10 Marshfellows
00000498

Marshfellows
00000499

TBD
00000500

Defeat 100 Marshfellows
00000501

Marshfellows
00000502

TBD
00000503

Defeat 1000 Marshfellows
00000504

TBD
00000505

Defeat 1000 Gummy Bears
00000506

Gummy Bears
00000507

Gummy Bears
00000508

Gummy Worms
00000509

Defeat 10 Gummy Worms
00000510

Defeat 100 Gummy Worms
00000511

Defeat 1000 Gummy Worms
00000512

Honey Badgers
00000513

Defeat 10 Honey Badgers
00000514

Defeat 100 Honey Badgers
00000515

Defeat 1000 Honey Badgers
00000516

Whatchamagolems
00000517

Defeat 10 Whatchamagolems
00000518

Defeat 100 Whatchamagolems
00000519

Defeat 1000 Whatchamagolems
00000520

Gummy Bunnies
00000521

Defeat 10 Gummy Bunnies
00000522

Defeat 100 Gummy Bunnies
00000523

Defeat 1000 Gummy Bunnies
00000524

Brudels
00000525

Defeat 10 Brudels
00000526

Defeat 100 Brudels
00000527

Defeat 1000 Brudels
00000528

Gnomes
00000529

Defeat 10 Gnomes
00000530

Defeat 100 Gnomes
00000531

Defeat 1000 Gnomes
00000532

Harshfellow
00000533

Clashfellow
00000534

Thrashfellow
00000535

Gummy Acher
00000536

Gummy Rumbler
00000537

Gummy Drubber
00000538

Gummy Worm Squisher
00000539

Gummy Worm Smoosher
00000540

Gummy Worm Crusher
00000541

Badger of Pride
00000542

Badger of Honor
00000543

Badger of Courage
00000544

Candy Striker
00000545

Candy Scrapper
00000546

Candy Bane
00000547

Bunny Bopper
00000548

Bunny Thumper
00000549

Bunny Whomper
00000550

Brudelizer
00000551

AbracaBrudel
00000552

Toasty Brudality
00000553

Sweetest Hero of All
00000554

Save the Gummy Plant
00000556

Disrupt Nibbleheim
00000557

Disruptive Influence
00000558

Discover the Revolting Secret
00000559

Sweet Fancy Photojournalist
00000560

Gob Well Done
00000561

Restore Gobblerton
00000562

Most Valuable Customer
00000563

Complete mainline quests in Karamelle
00000564

Side Rustler
00000565

Complete all side quests in Karamelle
00000566

Clean Plate Club
00000567

Complete all quests in Karamelle
00000568

Gnome Culler
00000569

Gnome Destroyer
00000570

Gnome Wrecker
00000571

Koolakamba
00000572

Defeat 10 Koolakamba
00000573

Defeat 100 Koolakamba
00000574

Defeat 1000 Koolakamba
00000575

Defeat 10 Fossa
00000576

Fossa
00000577

Defeat 100 Fossa
00000578

Defeat 1000 Fossa
00000579

Defeat 10 Boarbarian
00000580

Boarbarian
00000581

Defeat 100 Boarbarian
00000582

Defeat 1000 Boarbarian
00000583

Defeat 10 Stray Kit-10
00000584

Stray Kit-10
00000585

Defeat 100 Stray Kit-10
00000586

Defeat 1000 Stray Kit-10
00000587

Defeat 10 Neighborhood Watch
00000588

Neighborhood Watch
00000589

Defeat 100 Neighborhood Watch
00000590

Defeat 1000 Neighborhood Watch
00000591

Defeat 10 Bull Gangsters
00000592

Bull Gangster
00000593

Defeat 100 Bull Gangsters
00000594

Defeat 1000 Bull Gangsters
00000595

Defeat 10 Cow Gangsters
00000596

Cow Gangster
00000597

Defeat 100 Cow Gangsters
00000598

Defeat 1000 Cow Gangsters
00000599

Defeat 10 Humango
00000600

Humango
00000601

Defeat 100 Humango
00000602

Defeat 1000 Humango
00000603

Cosmic Completionist
00000604

Complete ALL Lemuria Quests
00000605

Legend of Lemuria
00000606

Complete all side quests in Lemuria
00000607

Complete the quest "The Next Thing"
00000608

Complete the quest "On Your Feat"
00000609

Complete the quest "Heroes Don't Grow on Trees"
00000610

Complete the quest "Night Flight In the Light"
00000611

Complete the quest "Peace Meal"
00000612

Complete the quest "Villain For Hire"
00000613

Complete the quest "The Fane of the Ancient One"
00000614

Complete the quest "Solomon Joins the Party"
00000615

Complete the quest "Down to Earth Again"
00000616

Complete the quest "Bald-Faced Truth"
00000617

Unforgiven Too
00000618

Earn the Throne of Scones
00000619

Elevated Monstrologist
00000620

Grand Monstrologist
00000621

Prestigious Monstrologist
00000622

Superlative Monstrologist
00000623

Preeminent Monstrologist
EMPTYDESCRIPTION
This title displays not title. This must be the first badge (at index 0). DO NOT DELETE IT.
Display no badge title
EMPTYINFO


EMPTYTITLE
This is NOT a test. This badge is necessary to provide an opportunity for the player to have no badge title.

